In [115]:
import pandas as pd
import numpy as np


data = pd.read_csv("Test1.csv")
data

     Name   Age  Experience   Salary
0  Rahul   25.0         5.0  10000.0
1    Ozzy  30.0        10.0  20000.0
2   Noel   40.0        20.0  30000.0
3  Tejas    NaN         2.0   5000.0
4   Rajit  28.0         NaN   8000.0
5     NaN  26.0         5.0   6000.0
6   Kevi   32.0         7.0      NaN

In [116]:
import pyspark

In [117]:
#start spark session
from pyspark.sql import SparkSession

#spark1 = SparkSession.builder.appName('Practise1').getOrCreate()

sparksesh = SparkSession.builder.appName("Sesh1").getOrCreate()

In [118]:
sparksesh

In [119]:
#read the csv
df_ps = sparksesh.read.option('header','true').csv('Test1.csv',inferSchema = True)

In [120]:
df_ps.show()

+------+----+----------+------+
|  Name| Age|Experience|Salary|
+------+----+----------+------+
|Rahul |  25|         5| 10000|
|  Ozzy|  30|        10| 20000|
| Noel |  40|        20| 30000|
|Tejas |null|         2|  5000|
| Rajit|  28|      null|  8000|
|  null|  26|         5|  6000|
| Kevi |  32|         7|  null|
+------+----+----------+------+

In [121]:
#Check schema
df_ps.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [122]:
type(df_ps) #data frames are basically data structures

pyspark.sql.dataframe.DataFrame

In [123]:
df_ps.columns #columns

['Name', 'Age', 'Experience', 'Salary']

In [124]:
df_ps.head(3)  #Displays in list format unlike pandas

[Row(Name='Rahul ', Age=25, Experience=5, Salary=10000),
 Row(Name='Ozzy', Age=30, Experience=10, Salary=20000),
 Row(Name='Noel ', Age=40, Experience=20, Salary=30000)]

In [125]:
df_ps.select(['Name','Experience']).show() #We need the select function to access columns and indexing

+------+----------+
|  Name|Experience|
+------+----------+
|Rahul |         5|
|  Ozzy|        10|
| Noel |        20|
|Tejas |         2|
| Rajit|      null|
|  null|         5|
| Kevi |         7|
+------+----------+

In [126]:
df_ps.describe().show()

+-------+------+------------------+-----------------+------------------+
|summary|  Name|               Age|       Experience|            Salary|
+-------+------+------------------+-----------------+------------------+
|  count|     6|                 6|                6|                 6|
|   mean|  null|30.166666666666668|8.166666666666666|13166.666666666666|
| stddev|  null| 5.455883674224247|6.369196704975177|  9847.16541278081|
|    min| Kevi |                25|                2|              5000|
|    max|Tejas |                40|               20|             30000|
+-------+------+------------------+-----------------+------------------+

In [127]:
#Adding columns
df_ps = df_ps.withColumn('Experience after 2 yrs',df_ps['Experience']+2)

In [128]:
df_ps.show()

+------+----+----------+------+----------------------+
|  Name| Age|Experience|Salary|Experience after 2 yrs|
+------+----+----------+------+----------------------+
|Rahul |  25|         5| 10000|                     7|
|  Ozzy|  30|        10| 20000|                    12|
| Noel |  40|        20| 30000|                    22|
|Tejas |null|         2|  5000|                     4|
| Rajit|  28|      null|  8000|                  null|
|  null|  26|         5|  6000|                     7|
| Kevi |  32|         7|  null|                     9|
+------+----+----------+------+----------------------+

In [129]:
#Drop columns
df_ps = df_ps.drop('Experience after 2 yrs')

In [130]:
df_ps.show()

+------+----+----------+------+
|  Name| Age|Experience|Salary|
+------+----+----------+------+
|Rahul |  25|         5| 10000|
|  Ozzy|  30|        10| 20000|
| Noel |  40|        20| 30000|
|Tejas |null|         2|  5000|
| Rajit|  28|      null|  8000|
|  null|  26|         5|  6000|
| Kevi |  32|         7|  null|
+------+----+----------+------+

In [131]:
#Rename a column

df_ps = df_ps.withColumnRenamed('Name','New name')

In [132]:
df_ps.show()

+--------+----+----------+------+
|New name| Age|Experience|Salary|
+--------+----+----------+------+
|  Rahul |  25|         5| 10000|
|    Ozzy|  30|        10| 20000|
|   Noel |  40|        20| 30000|
|  Tejas |null|         2|  5000|
|   Rajit|  28|      null|  8000|
|    null|  26|         5|  6000|
|   Kevi |  32|         7|  null|
+--------+----+----------+------+

In [133]:
#Dropping a column
df_ps.drop('Age').show()

+--------+----------+------+
|New name|Experience|Salary|
+--------+----------+------+
|  Rahul |         5| 10000|
|    Ozzy|        10| 20000|
|   Noel |        20| 30000|
|  Tejas |         2|  5000|
|   Rajit|      null|  8000|
|    null|         5|  6000|
|   Kevi |         7|  null|
+--------+----------+------+

In [134]:
df_ps.show()

+--------+----+----------+------+
|New name| Age|Experience|Salary|
+--------+----+----------+------+
|  Rahul |  25|         5| 10000|
|    Ozzy|  30|        10| 20000|
|   Noel |  40|        20| 30000|
|  Tejas |null|         2|  5000|
|   Rajit|  28|      null|  8000|
|    null|  26|         5|  6000|
|   Kevi |  32|         7|  null|
+--------+----+----------+------+

In [135]:
#Dropping null values
df_ps.na.drop(how='all',subset=['salary']).show() #use the thresh parameter to specify min. required non-null values

+--------+----+----------+------+
|New name| Age|Experience|Salary|
+--------+----+----------+------+
|  Rahul |  25|         5| 10000|
|    Ozzy|  30|        10| 20000|
|   Noel |  40|        20| 30000|
|  Tejas |null|         2|  5000|
|   Rajit|  28|      null|  8000|
|    null|  26|         5|  6000|
+--------+----+----------+------+

In [144]:
#Filling missing values

df_ps.fillna({'New Name': 'hi'}).fillna({'Age': -1}).fillna({'Experience': -1}).fillna({'Salary': -1}).show()

+--------+---+----------+------+
|New name|Age|Experience|Salary|
+--------+---+----------+------+
|  Rahul | 25|         5| 10000|
|    Ozzy| 30|        10| 20000|
|   Noel | 40|        20| 30000|
|  Tejas | -1|         2|  5000|
|   Rajit| 28|        -1|  8000|
|      hi| 26|         5|  6000|
|   Kevi | 32|         7|    -1|
+--------+---+----------+------+

In [145]:
from pyspark.ml.feature import Imputer

imputer = Imputer(inputCols=['Age','Experience','Salary'], 
                  outputCols=["{}_imputed".format(col) for col in ['Age','Experience','Salary']]
                 ).setStrategy("mean")

In [146]:
imputer.fit(df_ps).transform(df_ps).show()

+--------+----+----------+------+-----------+------------------+--------------+
|New name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+--------+----+----------+------+-----------+------------------+--------------+
|  Rahul |  25|         5| 10000|         25|                 5|         10000|
|    Ozzy|  30|        10| 20000|         30|                10|         20000|
|   Noel |  40|        20| 30000|         40|                20|         30000|
|  Tejas |null|         2|  5000|         30|                 2|          5000|
|   Rajit|  28|      null|  8000|         28|                 8|          8000|
|    null|  26|         5|  6000|         26|                 5|          6000|
|   Kevi |  32|         7|  null|         32|                 7|         13166|
+--------+----+----------+------+-----------+------------------+--------------+